testing/ellipse2dplanar_of/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions  [0 1 -1 0 0 0 0];
internalField uniform (44.44 0 0);

boundaryField
{
    inlet       { type fixedValue; value uniform (44.44 0 0); }
    outlet      { type zeroGradient; }
    top         { type zeroGradient; }
    body        { type noSlip; }
    symmetry    { type symmetry; }
    symAxis     { type symmetry; }
    front       { type empty; }
    back        { type empty; }
}
