testing/ellipse2dplanar_of/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
    {
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;    }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    front
    {
        type            empty;
        physicalType    empty;
        nFaces          4874;
        startFace       7536;    }
    back
    {
        type            empty;
        physicalType    empty;
        nFaces          4874;
        startFace       12410;    }
    symmetry
    {
        type            symmetry;
        physicalType    symmetry;
        nFaces          62;
        startFace       17284;    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          12;
        startFace       17346;    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       17358;    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          12;
        startFace       17398;    }
    body
    {
        type            wall;
        physicalType    wall;
        nFaces          118;
        startFace       17410;    }
    symAxis
    {
        type            symmetry;
        nFaces          14;
        startFace       17528;    }
)

// ************************************************************************* //
